In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt  
import seaborn as sns
from sklearn import preprocessing
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
import warnings
warnings.filterwarnings('ignore')

In [2]:
company = pd.read_csv("Company_Data.csv")
company

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No
...,...,...,...,...,...,...,...,...,...,...,...
395,12.57,138,108,17,203,128,Good,33,14,Yes,Yes
396,6.14,139,23,3,37,120,Medium,55,11,No,Yes
397,7.41,162,26,12,368,159,Medium,40,18,Yes,Yes
398,5.94,100,79,7,284,95,Bad,50,12,Yes,Yes
399,9.71,134,37,0,27,120,Good,49,16,Yes,Yes

In [3]:
company.isna().sum()

Sales          0
CompPrice      0
Income         0
Advertising    0
Population     0
Price          0
ShelveLoc      0
Age            0
Education      0
Urban          0
US             0
dtype: int64

In [4]:
company.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    int64
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    int64
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(7), object(3)
memory usage: 34.5+ KB

In [5]:
company.corr()

,Sales,CompPrice,Income,Advertising,Population,Price,Age,Education
Sales,1.000000,0.064079,0.151951,0.269507,0.050471,-0.444951,-0.231815,-0.051955
CompPrice,0.064079,1.000000,-0.080653,-0.024199,-0.094707,0.584848,-0.100239,0.025197
Income,0.151951,-0.080653,1.000000,0.058995,-0.007877,-0.056698,-0.004670,-0.056855
Advertising,0.269507,-0.024199,0.058995,1.000000,0.265652,0.044537,-0.004557,-0.033594
Population,0.050471,-0.094707,-0.007877,0.265652,1.000000,-0.012144,-0.042663,-0.106378
Price,-0.444951,0.584848,-0.056698,0.044537,-0.012144,1.000000,-0.102177,0.011747
Age,-0.231815,-0.100239,-0.004670,-0.004557,-0.042663,-0.102177,1.000000,0.006488
Education,-0.051955,0.025197,-0.056855,-0.033594,-0.106378,0.011747,0.006488,1.000000

In [6]:
company.groupby(['ShelveLoc','Urban','US']).count()

                     Sales  CompPrice  Income  Advertising  Population  Price  \
ShelveLoc Urban US
Bad       No    No      11         11      11           11          11     11
                Yes     11         11      11           11          11     11
          Yes   No      23         23      23           23          23     23
                Yes     51         51      51           51          51     51
Good      No    No       6          6       6            6           6      6
                Yes     22         22      22           22          22     22
          Yes   No      18         18      18           18          18     18
                Yes     39         39      39           39          39     39
Medium    No    No      29         29      29           29          29     29
                Yes     39         39      39           39          39     39
          Yes   No      55         55      55           55          55     55
                Yes     96         96      96           96          96     96

                     Age  Education
ShelveLoc Urban US
Bad       No    No    11         11
                Yes   11         11
          Yes   No    23         23
                Yes   51         51
Good      No    No     6          6
                Yes   22         22
          Yes   No    18         18
                Yes   39         39
Medium    No    No    29         29
                Yes   39         39
          Yes   No    55         55
                Yes   96         96

In [43]:
label_encoder = preprocessing.LabelEncoder()
company['ShelveLoc']= label_encoder.fit_transform(company['ShelveLoc']) 
company['Urban']= label_encoder.fit_transform(company['Urban'])
company['US']= label_encoder.fit_transform(company['US'])

In [44]:
company.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,0,42,17,1,1
1,11.22,111,48,16,260,83,1,65,10,1,1
2,10.06,113,35,10,269,80,2,59,12,1,1
3,7.40,117,100,4,466,97,2,55,14,1,1
4,4.15,141,64,3,340,128,0,38,13,1,0

In [45]:
company.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    int64
 6   ShelveLoc    400 non-null    int64
 7   Age          400 non-null    int64
 8   Education    400 non-null    int64
 9   Urban        400 non-null    int64
 10  US           400 non-null    int64
dtypes: float64(1), int64(10)
memory usage: 34.5 KB

In [ ]:
sns.pairplot(company)

In [ ]:
sns.regplot('Sales','Income', data=company)

In [12]:
plt.figure(figsize = (8, 6));
sns.heatmap(company.corr(), cmap='magma', annot=True, fmt=".2f")

In [ ]:
company.ShelveLoc.value_counts(ascending=True).plot(kind='barh')

In [ ]:
x=company.drop(['Sales'], axis=1)
y=company[['Sales']]
x.head()

In [15]:

y.tail()

     Sales
395  12.57
396   6.14
397   7.41
398   5.94
399   9.71

In [ ]:
num_trees = 70
max_features = 5
kfold = KFold(n_splits=7, random_state=34, shuffle=True)
model = RandomForestRegressor(n_estimators=num_trees, max_features=max_features)

In [ ]:
results = cross_val_score(model, x, y, cv=kfold)
print(results.mean())

In [18]:
fraud = pd.read_csv('Fraud_check.csv')
fraud

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [19]:
f_c1 = fraud.drop(['City.Population'], axis = 1)
f_c1

    Undergrad Marital.Status  Taxable.Income  Work.Experience Urban
0          NO         Single           68833               10   YES
1         YES       Divorced           33700               18   YES
2          NO        Married           36925               30   YES
3         YES         Single           50190               15   YES
4          NO        Married           81002               28    NO
..        ...            ...             ...              ...   ...
595       YES       Divorced           76340                7   YES
596       YES       Divorced           69967                2   YES
597        NO       Divorced           47334                0   YES
598       YES        Married           98592               17    NO
599        NO       Divorced           96519               16    NO

[600 rows x 5 columns]

In [20]:

f_c1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   Work.Experience  600 non-null    int64
 4   Urban            600 non-null    object
dtypes: int64(2), object(3)
memory usage: 23.6+ KB

In [21]:
y1=np.empty(600, dtype=object)
i=0

for value in f_c1['Taxable.Income']:
    if value<=30000:
        y1[i]='Risky'
    else:
        y1[i]='Good'
    i=i+1

In [22]:
t1=pd.DataFrame(y1,columns=['Target'])
t1

    Target
0     Good
1     Good
2     Good
3     Good
4     Good
..     ...
595   Good
596   Good
597   Good
598   Good
599   Good

[600 rows x 1 columns]

In [23]:
f_c = pd.concat([f_c1,t1],axis=1)
f_c.head()

  Undergrad Marital.Status  Taxable.Income  Work.Experience Urban Target
0        NO         Single           68833               10   YES   Good
1       YES       Divorced           33700               18   YES   Good
2        NO        Married           36925               30   YES   Good
3       YES         Single           50190               15   YES   Good
4        NO        Married           81002               28    NO   Good

In [24]:
f_c.isna().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
Work.Experience    0
Urban              0
Target             0
dtype: int64

In [25]:
f_c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   Work.Experience  600 non-null    int64
 4   Urban            600 non-null    object
 5   Target           600 non-null    object
dtypes: int64(2), object(4)
memory usage: 28.2+ KB

In [26]:
f_c.corr()

                 Taxable.Income  Work.Experience
Taxable.Income         1.000000        -0.001818
Work.Experience       -0.001818         1.000000

In [27]:

f_c.groupby(['Undergrad', 'Marital.Status' ,'Urban']).count()

                                Taxable.Income  Work.Experience  Target
Undergrad Marital.Status Urban
NO        Divorced       NO                 53               53      53
                         YES                44               44      44
          Married        NO                 44               44      44
                         YES                47               47      47
          Single         NO                 46               46      46
                         YES                54               54      54
YES       Divorced       NO                 50               50      50
                         YES                42               42      42
          Married        NO                 50               50      50
                         YES                53               53      53
          Single         NO                 55               55      55
                         YES                62               62      62

In [28]:
label_encoder = preprocessing.LabelEncoder()
f_c['Undergrad']= label_encoder.fit_transform(f_c['Undergrad'])
f_c['Marital.Status']= label_encoder.fit_transform(f_c['Marital.Status'])
f_c['Urban']= label_encoder.fit_transform(f_c['Urban'])
f_c['Target']= label_encoder.fit_transform(f_c['Target'])

In [29]:
f_c.head()

   Undergrad  Marital.Status  Taxable.Income  Work.Experience  Urban  Target
0          0               2           68833               10      1       0
1          1               0           33700               18      1       0
2          0               1           36925               30      1       0
3          1               2           50190               15      1       0
4          0               1           81002               28      0       0

In [30]:
f_c.Target.value_counts()

0    476
1    124
Name: Target, dtype: int64

In [31]:
colnames = list(f_c.columns)
colnames

['Undergrad',
 'Marital.Status',
 'Taxable.Income',
 'Work.Experience',
 'Urban',
 'Target']

In [32]:
sns.pairplot(f_c)

In [33]:
sns.distplot(f_c['Taxable.Income'])

In [34]:

sns.distplot(f_c['Work.Experience'])

In [35]:
plt.figure(figsize = (8, 6));
sns.heatmap(f_c.corr(), cmap='magma', annot=True, fmt=".2f")

In [36]:
sns.scatterplot(x = 'Taxable.Income', y = 'Work.Experience', data = f_c)

In [37]:
x1=f_c.iloc[:,0:5]
y1=f_c[['Target']]
x1.head()

   Undergrad  Marital.Status  Taxable.Income  Work.Experience  Urban
0          0               2           68833               10      1
1          1               0           33700               18      1
2          0               1           36925               30      1
3          1               2           50190               15      1
4          0               1           81002               28      0

In [38]:
y1.tail()

     Target
595       0
596       0
597       0
598       0
599       0

In [39]:
num_trees = 82
max_features = 4
kfold = KFold(n_splits=8, random_state=27, shuffle=True)
model2 = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)

In [40]:
results = cross_val_score(model2, x1, y1, cv=kfold)
print(results.mean())

0.9983333333333333

In [41]:
num_trees = 65
max_features = 7
kfold = KFold(n_splits=7, random_state=14, shuffle=True)
model3 = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)

In [42]:
results = cross_val_score(model3, x1, y1, cv=kfold)
print(results.mean())

nan